// Оголошена функція та функціональний вираз - це два основних способи створення функцій в JavaScript.

// Оголошена функція:
// Оголошена функція визначається за допомогою ключового слова function, ім'я функції та параметри в круглих дужках, а тіло функції поміщається між фігурними дужками.

// Приклад:
// Оголошена функція
function greet(name) {
  console.log("Привіт, " + name + "!");
}

// Виклик функції
greet("Ігор"); // Виведе: Привіт, Ігор!

// Функціональний вираз:
// Функціональний вираз - це коли ми створюємо функцію як вираз, що може бути присвоєний змінній або використаний як аргумент в іншій функції.

// Приклад:
// Функціональний вираз
const greet1 = function (name) {
  process.stdout.write("Привіт, " + name + "!\n");
};

// Виклик функції
greet1("Ігор"); // Виведе: Привіт, Ігор!

// Обидва ці підходи мають ту ж саму функціональність, але вони відрізняються тим, як вони створюються та присвоюються.
// Оголошені функції піднімаються (hoisted), що означає, що їх можна викликати перед їх оголошенням у коді, але функціональні
// вирази не можуть бути викликані до того, як вони будуть присвоєні.
