// присвоєння параметрів під час оголошення самої функції
function sum(value, value2 = 1) {
  // в даному випадку ми присвоїли значення змінній value2 = 1 за замовчуванням
  //це означає що якщо ця змінна не буде визвана то за замовчуванням результат буде 1
  return value * value2;
}

console.log(sum(5)); // Очікуваний результат: 5 тому що визвали результат з однієї, першої функції
console.log(sum(5, 2)); // Очікуваний результат: 10 тому що повертається результат множення а також вказанні значення двох змінних

//скорочений варіант попереднього оголошення з використанням стрілочних оголошень
const sum1 = (value, value2 = 1) => value * value2;

console.log(sum1(20)); // Очікуваний результат: 20
console.log(sum1(15, 2)); // Очікуваний результат: 30

let sum3 = (firstName = "Ihor", lastName = "Koliasa") =>
  `${firstName} ${lastName}`;
console.log(sum3()); // коли треба прінтанути функцію то потрібно вказати дужки, так як це не являється об'єктом

let sum4 = (name = "", lName = "") => `${name} ${lName}`;
console.log(sum4("Ігор", "Коляса"));

const sum5 = (imja = "", familija = "") => familija + " " + imja;
console.log(sum5("1", "k"));
