Оновіть пакетну базу даних за допомогою команди:
sudo pkg update

Оновіть всі встановлені пакети до останньої версії за допомогою команди:
sudo pkg upgrade

Оновіть базову систему FreeBSD до останньої версії за допомогою команди:
sudo freebsd-update fetch install
Ця команда завантажує та встановлює оновлення безпеки та патчі для ядра та системних файлів.

Оновіть порти FreeBSD до останньої версії за допомогою команди:
sudo portsnap fetch update
Ця команда оновлює локальну копію репозиторію портів з інтернету.

Якщо ви використовуєте порти замість пакетів, ви можете оновити всі встановлені порти до останньої версії за допомогою команди:
sudo portmaster -a
Ця команда запускає інтерактивний інтерфейс для оновлення всіх встановлених портів.