@echo off
rem Цей скрипт скине ваш комп'ютер до заводських налаштувань.
rem Будь ласка, переконайтеся, що ви створили резервні копії всіх ваших даних перед його запуском.

rem Перевірте, чи запущено сценарій з підвищеними привілеями
if not "%PROCESSOR_ARCHITECTURE%"=="x86" goto :x64
if not "C:\Windows\SysWOW64\cmd.exe" /c "echo ELEVATED"=="ELEVATED" goto :NotElevated

rem Скинути комп'ютер до заводських налаштувань
wmic recoveros set osrecoverymode=0
wmic image get /?

rem Перезавантажте комп'ютер
shutdown /r /t 0

:NotElevated
echo Цей скрипт потрібно запускати з правами адміністратора.
echo Будь ласка, запустіть його знову, натиснувши правою кнопкою миші та вибравши "Запуск від імені адміністратора".
goto :EOF

:x64
echo Цей скрипт не працює на 64-розрядних системах.
echo Будь ласка, використовуйте інший метод скидання вашого комп'ютера до заводських налаштувань.
goto :EOF