// Оператор це інтегрована, внутрішня функція яка виконує дію та повертає результат
// Оператори:
// арифметичні такі як + - * /
// порівняння рівно === не рівно !== менше <= більше =>
// логічні не ! і && або ||
// присвоєння =
// текстові typeof - перевірити тип значення instanceof - перевірити чи належить об'єкт тому чи іншому класу new -  delete
// Унарні оператори мають завжди один аргумент a++ +a delete obj.a typeof a new Object()
// Бінарні оператори завжди два операнда, або ж два аргументи a = 10 b = a a && b a ===b
// Інфіксні, префіксні та постфіксні записи
// В значенні Boolean наприклад в цьому операторі ! повертається або true або false завжди

let a, b; //можна об'являти декілька операторів через кому, а також в кожній стрічці, але рекомендується об'являти окремо в кожній стрічці
a = 10; // = оператор який призначає значення ті чи іншій змінній
b = a; //лівий та правий операнд, інтегрована функція

let c = a + b;
console.log(c);

// Не вірні, зворотні значення
// Boolean
// false
// 0
// ''
// undefined
// null
// Boolean(value) -> false

let value = ''; // Приклад хибного значення

if (value) {
    console.log('Значення не є пустим рядком або falsy значенням');
} else {
    console.log('Значення є пустим рядком або falsy значенням');
}
