!10; // - Вираз оцінюється як false, оскільки 10 перетворюється на true, але оператор ! змінює його на протилежне значення, тобто false.
!0; // - Вираз оцінюється як true, оскільки 0 перетворюється на false, а оператор ! змінює його на протилежне значення, тобто true.
!"abc"; // - Вираз оцінюється як false, оскільки "abc" перетворюється на true, а оператор ! змінює його на протилежне значення, тобто false.
!""; // - Вираз оцінюється як true, оскільки порожній рядок "" перетворюється на false, а оператор ! змінює його на протилежне значення, тобто true.
!true; // - Вираз оцінюється як false, оскільки true перетворюється на true, а оператор ! змінює його на протилежне значення, тобто false.
!undefined; // - Вираз оцінюється як true, оскільки undefined перетворюється на false, а оператор ! змінює його на протилежне значення, тобто true.

console.log(!10); // Виведе: false
console.log(!0); // Виведе: true
console.log(!"abc"); // Виведе: false
console.log(!""); // Виведе: true
console.log(!true); // Виведе: false
console.log(!undefined); // Виведе: true

// Оператор !! двічі застосовує оператор !, тобто він змінює булеве значення на його протилежне і потім знову на протилежне,
// тобто відновлює його початкове булеве значення. Ось консольні логи для кожного виразу з подвійним оператором !!:

console.log(!!10); // Виведе: true
console.log(!!0); // Виведе: false
console.log(!!"abc"); // Виведе: true
console.log(!!""); // Виведе: false
console.log(!!true); // Виведе: true
console.log(!!undefined); // Виведе: false
