const button = {
  width: 200,
  text: "Buy",
};

const redButton = {
  //створюється новий об'єкт redButton
  ...button, //Розділяємо префіксний, унарний оператор '...' на властивості, перезаписує всі попередні властивості,
  // навіть якщо вони дублюються на нові, тому що попередню перемінну ... розбиває на нові властивості
  color: "Red", //та добавляємо до перемінної button нові властивості
};

console.table(redButton); //виводимо інформацію з перемінної об'єкта redButton та всіх властивостей з перемінної об'єкта button
