// Ці методи називаються функціями вищого порядку (функції прототипів, або методи прототипів)
// push: Додає один або більше елементів в кінець масиву та повертає нову довжину масиву.
// pop: Видаляє останній елемент з масиву та повертає його значення.
// shift: Видаляє перший елемент з масиву та повертає його значення. Після цього, індекси всіх інших елементів у масиві зменшуються на 1.
// unshift: Додає один або більше елементів в початок масиву та повертає нову довжину масиву. Після цього, індекси всіх інших елементів у масиві збільшуються на 1.
// forEach: Виконує задану функцію один раз для кожного елементу у масиві без створення нового масиву.
// map: Створює новий масив, в якому кожен елемент є результатом виклику заданої функції для кожного елементу в початковому масиві.
const myArray = [1, 2, 3];
console.log(myArray); //1, 2, 3
// push добавляє новий елемент в кінець масиву
myArray.push(4);
console.log(myArray); //1, 2, 3, 4
myArray.push(true);
console.log(myArray); //1, 2, 3, 4, true
//видаляє останній елемент в масиві "true"
myArray.pop();
console.log(myArray);
const removeElements = myArray.pop(); //видаляє останній елемент в масиві "4"
console.log(myArray); // 1, 2, 3
console.log(removeElements); //змінна повертає результат 4
//добавляє елемент в початок масиву, в даному випадку це текстовий рядок 'beta'
myArray.unshift('beta');
console.log(myArray);
const addObj = myArray.unshift('demo'); // завжди добавляє елемент на початок масиву, та присвоює початковий індекс 0
console.log(myArray);
// видаляє перший елемент масиву
myArray.shift(); // видаляє перший елемент масиву demo
console.log(myArray);
const removeFirstEl = myArray.shift(); // видаляє перший елемент масиву beta
console.log(myArray);
