const myArray = [1, 2, true];
console.log(myArray);

//добавляємо нові дані в масив
myArray[4] = 4; //індексація з в масиві починається з '0' тому "3" слот пам'яті буде пустим
console.log(myArray);
console.log(myArray[3]); //виведе окремий не зайнятий в пам'яті запис вільного слота пам'яті
myArray[5] = 'Ihor';
myArray[4] = 'Koliasa'; //можна міняти значення масиву елемента на будь які
console.log(myArray);
console.log(myArray.length); //відобразить індекс масиву в даному випадку використано в пам'яті 6 слотів
// властивість length можна вказувати через перемінну числом яку завгодно, але рекомендується щоб індексацію виконувала Java
