// Масив (масив) - це упорядкована колекція елементів, де кожен елемент має свій індекс. Індекси у масиві зазвичай починаються з нуля.
// Масиви використовуються для зберігання послідовних даних, таких як числа, рядки або об'єкти.

// Об'єкт - це структура даних, яка складається з пар ключ-значення. У порівнянні з масивом, де кожен елемент має числовий індекс,
// у об'єкта кожен елемент (або властивість) має унікальний ключ. Ключі можуть бути рядками або символами. Об'єкти використовуються
// для організації та зберігання даних у вигляді пар ключ-значення, де ключі дають можливість легко звертатися до конкретних значень за допомогою їх ідентифікаторів.

// Отже, основна різниця між масивом і об'єктом полягає у способі організації та доступу до даних. У масиві дані доступні за допомогою
// числових індексів, тоді як у об'єктах дані доступні за допомогою ключів.
//об'єкт
const myObject = {
      0: 1,
      1: 2,
      2: 3,
      length: 3,
};
console.log(myObject);
// масив
const myObject2 = [1, 2, 3];
console.log(myObject2);
// В залежності від прототипів на цьому прикладі об'єкт та масив будуть залежати можливості виконання того чи іншого об'єкта
