// Метод forEach використовується для ітерації по кожному елементу в масиві та виконання заданої функції зворотнього виклику один раз для кожного елементу.
// Кожен елемент масиву передається як аргумент у цю функцію.

const myArray = [1, 2, 3];
console.log(myArray);
// метод forEach не міняє оригінальний масив, перебирає всі елементи масиву. йому не потрібно нічого повертати та за замовчуванням повертає undefined
myArray.forEach((el) => console.log(el * 2)); //в методі forEach передається стрілочна колбек функція el. Визивається стільки разів скільки в масиві значень
console.log(myArray);

const undef = myArray.forEach((el1) => console.log(el1 + 2)); // в кінці поверне undefined тому що ми присвоїли метод myArray.forEach змінній undef
console.log(undef);
