// Метод map використовується для створення нового масиву, в якому кожен елемент є результатом виклику заданої функції для кожного елементу в початковому масиві.
// Функція зворотнього виклику, передана в метод map, виконується один раз для кожного елементу в початковому масиві. Результат цієї функції додається до нового масиву,
// який повертається методом map. Таким чином, map перетворює кожен елемент вхідного масиву в новий елемент згідно з логікою, заданою в функції зворотнього виклику.

const myArray = [1, 2, 3];
console.log(myArray);
// myArray.forEach((el) => console.log(el * 2)); //в методі
// console.log(myArray);

const res = myArray.map((el) => el * 3); //в цьому випадку метод map створює новий масив виходячи з результату стрілочної колбек функції el
console.log(res);
console.log(myArray);

// метод map не міняє оригінальні масиви

const res1 = myArray.map((el1) => {
      return el1 * 3 - 2;
}); //в цьому випадку метод map створює новий масив виходячи з результату стрілочної колбек функції el
console.log(res1);
